Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་གསོལ་བ་གདབ་བོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་རྣམས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་བཞུགས་སུ་གསོལ་ལོ་ཞེས་སྨོན་ལམ་འདེབས་ཏེ།
en: They supplicate those who have passed beyond suffering to turn the wheel of Dharma and remain for the benefit of beings.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྔགས་པའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ aspiration of praise to all buddhas.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཐམས་ཅད་ཤིན་ཏུ་ཚར་གཅོད་པའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ aspiration to annihilate all demons consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལྟར་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ཅི་ནས་ཀྱང་བདུད་ཀྱི་སྒྲའམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་འབྱུང་བར་ཡང་མི་འགྱུར་བ་དེ་ལྟར་བདག་གིས་བྱའོ་ཞེས་སྨོན་ལམ་འདེབས་ཏེ།
en: Bodhisattvas aspire to ensure that as they attain complete buddhahood not even the names of demons shall be heard within their buddha realms and that none of the demonic gods shall manifest.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཐམས་ཅད་ཤིན་ཏུ་ཚར་གཅོད་པའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ aspiration to annihilate all demons.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱི་དྲིང་མི་འཇོག་པའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ aspiration not to rely on others consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གཞན་གྱི་དྲིང་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་མི་འདེབས་ཀྱི།
en: Bodhisattvas do not aspire toward unexcelled and complete awakening in reliance on others.

source: བདག་ཉིད་ཀྱི་ཤེས་རབ་ཀྱིས་དཔྱད་དེ།
en: Examining things by means of their own insight,

source: སེམས་ཅན་གྱི་ཁམས་སྡུག་བསྔལ་བ་ལ་བལྟས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་ཏེ།
en: they consider the suffering of sentient beings and so aspire toward unexcelled and complete awakening.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱི་དྲིང་མི་འཇོག་པའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ aspiration not to rely on others.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ limitless aspiration consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཚོགས་རྣམས་ཀྱི་ཕྱོགས་འགའ་ཞིག་བཟུང་ནས་ཉི་ཙེ་བའི་སྨོན་ལམ་མི་འདེབས་ཀྱི།
en: Bodhisattvas do not have limited aspirations based on meager accumulations for awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: they drape their robe over one shoulder, kneel down on their right knee,

source: སེམས་མི་སྐྱོ་བར་བྱས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སུ་བལྟས་ཏེ།
en: without any weariness look to the realms of the world in the ten directions.

source: དེ་དག་རྣམས་ལ་སྙིང་ཐག་པ་ནས་བསམས་ཏེ།
en: They sincerely consider all the

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཕྱོགས་བཅུ་ན་གནས་པ་དང་། གང་དག་དཀའ་བ་སྤྱོད་པ་ལ་གནས་པ་དང་། གང་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གནས་པ་དང་། སངས་རྒྱས་གང་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་དག་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་
en: bodhisattvas present there—all those who are practicing austerities, all those who reside at the seat of awakening, all the buddhas who have attained complete buddhahood, and all those who turn the wheel of Dharma.

source: ཆོས་བསྟན་པ་ཇི་སྙེད་པ་དེ་དག་ལ་མོས་པར་བྱེད་དོ། །མོས་པར་གྱུར་ནས་རྗེས་སུ་ཡི་རང་ངོ་།
en: As they consider them all, they are inspired by their Dharma teachings and rejoice in them.

source: རྗེས་སུ་ཡི་རང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་སྟེ།
en: With such joy they dedicate it all to unexcelled and complete awakening.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ limitless aspiration.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྲག་པའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ fearless aspiration consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ཡིན་ཡང་ཆོས་ཟབ་མོ་ཟབ་མོ་རྣམས་ཐོས་པ་དང་།
en: Even when beginner bodhisattvas hear the extremely profound Dharma,

source: སངས་རྒྱས་ཀྱི་ཆེ་བ་ཟབ་མོ་ཐོས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རོལ་པ་ཟབ་མོ་ཐོས་པ་དང་། ཐབས་མཁས་པའི་ཚུལ་ཟབ་མོ་ཐོས་ཀྱང་
en: and when they hear about the profound magnificence of the buddhas, the profound reveling of the bodhisattvas, and about the bodhisattvas’ profound skill in means,

source: མི་སྐྲག་རབ་ཏུ་མི་སྐྲག་ཤིན་ཏུ་སྐྲག་པར་མི་བྱེད་དོ།
en: they do not then become frightened but are instead utterly and completely fearless.

source: དེ་འདི་སྙམ་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་མཐའ་ཡས།
en: Thus they think, ‘The awakening of the buddhas is infinite.

source: སངས་རྒྱས་ཀྱི་ཡུལ་ཡང་མཐའ་ཡས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ཡང་མཐའ་ཡས་ཏེ།
en: Also the buddhas’ field of activity is infinite, and so is the way that the blessed buddhas mature sentient beings.

source: དེ་ནི་བདག་འདྲ་བས་ཤེས་པར་མི་ནུས་ཀྱི། སངས་རྒྱས་དག་ཉིད་ཀྱིས་མཁྱེན་གྱི། བདག་གིས་མི་ཤེས་སོ་སྙམ་དུ་སེམས་ཏེ།
en: Someone like me can’t comprehend any of that. All is known by the buddhas, yet not by me!’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྲག་པའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ fearless aspiration.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་མི་སྐྱོ་བའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ aspiration free of weariness consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དམུ་རྒོད་སེམས་ཅན་གདུལ་དཀའ་བར་རིག་སྟེ།
en: Bodhisattvas, aware of beings who are wild and can hardly be trained, will never grow tired of them

source: དེ་རྣམས་ཀྱིས་ཡི་ཆད་ནས། འདི་ལྟ་བུའི་དམུ་རྒོད་འདི་ལྟ་བུར་གདུལ་དཀའ་བའི་སེམས་ཅན་འདི་དག་གིས་ཆོག་གོ་ཞེས་ཏེ།
en: and think, ‘I have had enough of such beings who can hardly be trained!’

source: དེའི་ཕྱིར་ཡོངས་སུ་སྐྱེ་ཞིང་རྒྱབ་ཀྱིས་ཕྱོགས་པར་གྱུར་ཏེ།
en: They will therefore not feel weary and turn their backs upon such beings.

source: གང་ན་སེམས་ཅན་འདི་ལྟ་བུ་དག་གི་མིང་ཡང་མི་ཐོས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་པར་སྨོན་ལམ་མི་འདེབས་སོ།
en: They will not pray to be born in pure realms where not even the names of such beings can be heard.

source: སེམས་ཅན་གྱི་དོན་ལ་མ་ཕྱོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡོངས་སུ་དག་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་ཡང་མི་འགྱུར་ཏེ།
en: They will not become bodhisattvas who turn away from the welfare of sentient beings, taking birth in completely pure fields.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཅན་ནི་འདི་ལྟར་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ན་
en: Bodhisattvas with insight instead will think, ‘Throughout all the worlds,

source: སེམས་ཅན་གང་རྣམས་ངན་པ་བརྩོན་འགྲུས་ཆུང་བ། བླུན་པོ་གླེན་པ། ལུག་ལྟར་ལྐུགས་པའི་རང་བཞིན་ཅན་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བའི་ཆོས་ཅན།
en: all inferior beings who lack diligence, who are foolish and dumb, ignorant like sheep, and incapable of passing beyond suffering,

source: སེམས་ཅན་གྱི་ཁམས་མ་ལུས་པ་འདི་ལས་བསྙིགས་པ། སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་སྤངས་པར་གྱུར་པ་ཡོད་པ་
en: who are the lowest among the realms of sentient beings and who all buddhas and bodhisattvas have given up on

source: དེ་དག་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདུས་པར་གྱུར་ལ།
en: —may they all come to gather within my buddha realm!

source: བདག་གིས་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ཏུ་བཅུག་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་སེམས་སྐྱེད་དེ།
en: I shall cause them to sit at the seat of awakening so that they can fully awaken to unexcelled and complete buddhahood.’

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སེམས་པའི་སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཡང་བདུད་ཀྱི་གནས་ཐམས་ཅད་རབ་ཏུ་གཡོའོ།
en: Whenever a bodhisattva brings forth this perspective all the realms of the demons are deeply shaken,

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱང་དེའི་བསྔགས་པ་གསུང་བར་འགྱུར་རོ།
en: all buddhas praise it.

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: The buddha realm of such a bodhisattva will be completely pure and such a bodhisattva will quickly awaken to unexcelled and complete buddhahood.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་མི་སྐྱོ་བའི་སྨོན་ལམ་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ aspiration free of weariness.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེགས་པར་ཡོངས་སུ་རྫོགས་པའི་སྨོན་ལམ་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the bodhisattvas’ aspiration to full perfection.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་སྟེ།
en: Noble son, bodhisattvas aspire to sit at the seat of awakening,

source: བདུད་ཀྱི་དཔུང་གཞོམ་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་།
en: defeat the hordes of demons, and awaken to unexcelled and complete buddhahood.

source: ཡང་དེ་ལས་འདས་པར་སྨོན་ལམ་མི་འདེབས་པ་འདི་ནི་
en: Beyond that they do not have any aspirations.

source: ལེགས་པར་ཡོངས་སུ་རྫོགས་པའི་སྨོན་ལམ་པ་ཞེས་བྱའོ།
en: This is what is known as their aspiration to full perfection.

source: དཔེར་ན། མར་རམ། འབྲུ་མར་གྱི་སྣོད་ཁ་ཐ་ཆད་དུ་གང་སྟེ། ལྷག་པར་རྡུལ་ཕྲ་རབ་ཙམ་གྱི་ཐིགས་པ་ཡང་མི་ཤོང་ན།
en: As an analogy, think of a vessel that has been filled to the brim with butter or oil, so that in the end not even the most infinitesimal drop can be added.

source: དེའི་ཕྱིར་ཨེ་མའོ་སྣོད་གང་བ། ཨེ་མའོ་སྣོད་ཤིན་ཏུ་གང་བ་ཞེས་བྱའོ།
en: ‘Look,’ people will say, ‘this vessel is now full. Look, it is completely full!’

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལ་སྨོན་ལམ་ལེགས་པར་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་སྨོན་ལམ་མ་རྫོགས་པ་རྡུལ་ཕྲ་རབ་ཙམ་ཡང་མེད་དོ།
en: Likewise, because the bodhisattvas’ aspiration for true and complete awakening has been fully perfected, there is not even the most infinitesimal bit of an aspiration that has not been perfected.

source: དེ་བས་ན་ལེགས་པར་ཡོངས་སུ་རྫོགས་པའི་སྨོན་ལམ་ཞེས་བྱ་སྟེ།
en: That is why this is called the aspiration to full perfection

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities practice excellent aspirations.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who wield excellent power possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟིལ་གྱིས་མི་ནོན་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མི་ཚུགས་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། བསོད་ནམས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཤེས་རབ་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། འཁོར་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། དབང་གི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། གཟུངས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། རྣམ་པར་མི་འཁྲུགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། བཀའ་མི་གཅོག་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are the excellent power of not being subjugated, the excellent power of invincibility, the excellent power of merit, the excellent power of insight, the excellent power of their retinue, the excellent power of miracles, the excellent power of mastery, the excellent power of retention, the excellent power of unshakable blessings, and the excellent power of an unbreakable command.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟིལ་གྱིས་མི་ནོན་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ excellent power of not being subjugated.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་རྒོལ་བ་ཀུན་གྱིས་ཟིལ་གྱིས་མི་ནོན་པ་ཡིན་ཏེ།
en: Noble son, this is the power that ensures that bodhisattvas cannot be subdued by the attacks of opponents.

source: དེ་ལྟར་ན་ཟིལ་གྱིས་མི་ནོན་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of not being subjugated.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་ཚུགས་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of invincibility consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སྟོབས་ལ་གང་སྟོབས་ཀྱིས་ཐུབ་པའི་སེམས་ཅན་དེ་ལྟ་བུ་སེམས་ཅན་གྱི་རིས་ན་མེད་དེ།
en: This is the power that prevents any type of being from overpowering those bodhisattvas.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་ཚུགས་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of invincibility.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of merit consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་མ་བསྒྲུབས་པའི་བསོད་ནམས་ཀྱི་ཚོགས་འཇིག་རྟེན་པའམ། འཇིག་རྟེན་ལས་འདས་པ་དེ་གང་ཡང་མེད་དེ།
en: There is no mundane or supramundane virtuous accumulation that is not practiced by bodhisattvas.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of merit.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of insight consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མ་གཏོགས་པར་སངས་རྒྱས་ཀྱི་ཆོས་གང་ཡང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་མ་མཐོང་བ་དང་། མངོན་དུ་མ་བྱས་པ་དང་། ཁོང་དུ་མ་ཆུད་པ་དེ་དག་མེད་དེ།
en: Excepting the wisdom of the thus-gone ones, there are, for bodhisattvas, no qualities of buddhahood that they do not see, actualize, or comprehend with their insight.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of insight.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of their retinue consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཚུལ་ཁྲིམས་ཉམས་པ་མ་ཡིན། ལྟ་བ་ཉམས་པ་མ་ཡིན། ཆོ་ག་ཉམས་པ་མ་ཡིན། འཚོ་བ་ཉམས་པ་མ་ཡིན་གྱི།
en: Those within a bodhisattva’s retinue do not fail in terms of discipline, do not fail in terms of view, do not fail in terms of propriety, and do not fail in terms of livelihood.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ནི་བྱང་ཆུབ་སེམས་དཔའ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཉིད་ཡིན་ཏེ།
en: A bodhisattva’s retinue practices in accord with the bodhisattva.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of the retinue.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of miracles consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་པའི་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏེ།
en: The range of the application of the bodhisattvas’ miraculous powers outshines the entire range of mundane miraculous powers, as well as the entire range of the miraculous powers of the hearers and solitary buddhas.

source: དེའང་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ། མཆོག་གིས་ཟིལ་གྱིས་གནོན་ཏོ།
en: The miraculous power that bodhisattvas produce far outshines everything else.

source: དེ་འདོད་ན་འཛམ་བུའི་གླིང་སྐྲ་ཉག་མ་གཅིག་གི་རྩེ་མོ་ལ་འཇོག་གོ།
en: Thus, if they so wish, they can place all Jambu­dvīpa upon the tip of a single hair.

source: དེ་བཞིན་དུ་གླིང་བཞི་པ་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་དེ་བཞིན་ནོ།
en: Likewise, they can do the same with a world of four continents, or a thousandfold universe, or a millionfold universe, or a trichiliocosm.

source: དེ་འདོད་ན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་ཕྲ་རབ་གཅིག་ལ་འཇོག་གོ།
en: If they wish, they can place as many universes as there are grains of sand in the river Gaṅgā within a single particle.

source: དེ་བཞིན་དུ་གང་གཱའི་ཀླུང་གཉིས་ཀྱི་བྱེ་མ་སྙེད་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་ཕྲ་རབ་གཅིག་ལ་འཇོག་ཀྱང་རྡུལ་ཕྲ་རབ་དེ་ལ་གང་བ་དང་
en: And they can do the same with as many universes as there are grains of sand in two such rivers, or three, or four, five, ten, twenty, thirty, forty, fifty, or an inexpressible number of inexpressibly many such rivers.

source: རྡུལ་ཕྲ་རབ་གཅིག་ལ་འཇོག་ཀྱང་རྡུལ་ཕྲ་རབ་དེ་ལ་གང་བ་དང་། བྲི་བར་ཡང་མི་མངོན་ཏེ།
en: And yet, the particle neither fills up nor do the worlds diminish.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་རྣམས་ཀྱང་ཕན་ཚུན་དུ་འདོས་པར་མི་འགྱུར། སེམས་ཅན་དེ་རྣམས་ལ་གནོད་པར་ཡང་མི་འགྱུར་ཏེ།
en: Moreover, those worlds do not harm each other and none of the beings within them will suffer any harm.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of miracles.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དབང་གི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of mastery consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱིན་གྱིས་རློབ་བོ།
en: If they so wish, bodhisattvas may bless a trichiliocosm to be filled with the seven precious substances.

source: དེ་འདོད་ན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དུ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བར་བྱིན་གྱིས་རློབ་སྟེ།
en: If they wish, they may even bless an inexpressible number of inexpressibly many universes to be full of various precious substances.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དབང་གི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of mastery.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of retention consist in?

source: བྱང་ཆུབ་སེམས་དཔས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་གཅིག་ལ་ཐམས་ཅད་འཛིན་པར་བྱེད། ཁོང་དུ་ཆུད་པར་བྱེད། སྒོམ་པར་བྱེད་དེ།
en: In a single instant, bodhisattvas are able to recollect, comprehend, and apply

source: བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་དོན་ཐ་དད་པ་དང་། ཚིག་དང་ཡི་གེ་ཐ་དད་པ་དང་བརྗོད་པ་ཐ་དད་པ་དང་། ཚུལ་ཐ་དད་པའི་ཆོས་བཤད་པ་
en: each distinct meaning, word, expression, and way of teaching contained in all the Dharma discourses delivered by as many buddhas as there are in an inexpressible number of inexpressibly many buddha realms.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of retention.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་འཁྲུགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent power of unshakable blessings consist in?

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མ་གཏོགས་པར
en: Apart from thus-gone, worthy, perfect buddhas,

source: བྱང་ཆུབ་སེམས་དཔས་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་གང་རྣམ་པར་འཁྲུགས་པར་བྱེད་པའི་སེམས་ཅན་དེ་ལྟ་བུ་སེམས་ཅན་གྱི་རིས་ན་མེད་དེ།
en: there is no type of being whatsoever that can disturb what has been blessed through the blessings of a bodhisattva.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་འཁྲུགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of unshakable blessings.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཀའ་མི་གཅོག་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ excellent power of an unbreakable command.

source: ཐབས་མཁས་པ་མ་གཏོགས་པར་གང་བྱང་ཆུབ་སེམས་དཔའི་བཀའ་གཅོག་པའི་སེམས་ཅན་དེ་ལྟ་བུ་སེམས་ཅན་གྱི་རིས་ན་མ་མཐོང་སྟེ།
en: Noble son, there is no one to be seen within the realms of sentient beings who can break the command of a bodhisattva, except when that would serve as a skillful means.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཀའ་མི་གཅོག་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent power of unbreakable command.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities are endowed with excellent power.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with excellent wisdom possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གང་ཟག་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཆོས་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཉི་ཙེ་བ་མ་ཡིན་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། མི་འཕྲོགས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ལྷུན་གྱིས་གྲུབ་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are the excellent wisdom regarding the absence of self in a person, the excellent wisdom regarding the absence of self in phenomena, the excellent wisdom that is not temporary, the excellent wisdom of the sphere of absorption, the excellent wisdom of blessings, the excellent inalienable wisdom, the excellent wisdom that observes the activities of all sentient beings, the excellent wisdom of spontaneous accomplishment, the excellent wisdom concerning the characteristics of all phenomena, and the excellent wisdom that transcends the world.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཟག་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ excellent wisdom regarding the absence of self in a person.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་ཕུང་པོ་རྣམས་སྐྱེ་བ་ཡང་ཡང་དག་པར་མཐོང་། འཇིག་པ་དང་། འགོག་པ་ཡང་ཡང་དག་པར་མཐོང་ངོ་།
en: Noble son, bodhisattvas truly perceive the arising of the aggregates, as well as their disintegration and cessation.

source: དེས་ཕུང་པོ་སྐྱེ་བ་རྣམས་སྙིང་པོ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། གསོག་ཏུ་ཡང་དག་པར་མཐོང་།
en: They see that there is no essence to the arising aggregates, that they have no agent, and that they are without substance.

source: ཕུང་པོ་འགག་པ་རྣམས་འཇིག་པར་ཡང་དག་པར་མཐོང་སྟེ།
en: They see the disintegration of the ceasing aggregates.

source: དེ་འདི་སྙམ་དུ་ཕུང་པོ་འདི་དག་ནི་བདག་མེད་པ། སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གསོབ་མེད་པ་དང་། གང་ཟག་མེད་པ་ཡིན་མོད་ཀྱི།
en: Thus they think to themselves, ‘These aggregates are devoid of a self. They do not involve any sentient being, or a life force, or anything substantial, nor do they contain a person.

source: འོན་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་བདག་ཏུ་འཛིན་པ་ལ་མངོན་པར་ཞེན་པ་འདི་དག་ནི་འདི་ལྟར་
en: Nevertheless, childish, ordinary beings are attached to conceptions of a self, and so they think,

source: བདག་ཅག་གི་ཕུང་པོ་རྣམས་བདག་གོ། །བདག་ཅག་གི་ཕུང་པོ་རྣམས་ལ་བདག་ཡོད་དོ། །བདག་ཅག་གི་བདག་ལ་ཕུང་པོ་རྣམས་ཡོད་དོ། །བདག་ཅག་གི་བདག་ནི་ཕུང་པོ་ཅན་ནོ་སྙམ་སྟེ།
en: “Our aggregates are the self,” or “Our aggregates contain the self,” or “Our self contains the aggregates,” or “Our self possesses the aggregates.”

source: དེ་དག་བདག་ཏུ་འཛིན་པ་ལ་མངོན་པར་ཞེན་པས་དེ་ཁོ་ན་ཉིད་ཁོང་དུ་མི་ཆུད་དོ།
en: Thus, due to their attachment to conceptions of a self, they are unable to comprehend the nature of reality.

source: དེ་ཁོ་ན་ཉིད་ཁོང་དུ་མ་ཆུད་པས་མགལ་མེའི་འཁོར་ལོ་ལྟར་འཁོར་བར་འཁྱམ་མོ་སྙམ་དུ་སེམས་ཤིང་།
en: And because they fail to comprehend reality they continue to roam through cyclic existence like a swirling firebrand.’

source: དེ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: All this bodhisattvas know clearly and in accord with reality.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཟག་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom regarding the absence of self in a person.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom regarding the absence of self in phenomena consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་སྒྲོ་འདོགས་པ་དང་། ཆོས་ལ་སྐུར་པ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Bodhisattvas have a correct understanding regarding the unfounded superimpositions and negations made with respect to phenomena.

source: དེ་འདི་སྙམ་དུ་གློ་བུར་དུ་བྱུང་བའི་ཆོས་ལ་ཀུན་བརྟགས་པའི་མིང་གདགས་ཏེ།
en: Thus, they correctly recognize this: ‘Nominal designations of an imaginary nature are applied to temporary phenomena.
